PeftModelForCausalLM(
  (base_model): NASLoraModel(
    (model): LlamaForCausalLM(
      (model): LlamaModel(
        (embed_tokens): Embedding(32001, 4096)
        (layers): ModuleList(
          (0): LlamaDecoderLayer(
            (self_attn): LlamaAttention(
              (q_proj): Linear(
                in_features=4096, out_features=4096, bias=False
                (naslora_module): ModuleDict(
                  (default): ModuleList(
                    (0): ModuleList(
                      (0): Linear(in_features=4096, out_features=2, bias=False)
                      (1): Linear(in_features=2, out_features=4096, bias=False)
                    )
                  )
                )
                (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
              )
              (k_proj): Linear(
                in_features=4096, out_features=4096, bias=False
                (naslora_module): ModuleDict(
                  (default): ModuleList(
                    (0): ModuleList(
                      (0): Linear(in_features=4096, out_features=2, bias=False)
                      (1): Linear(in_features=2, out_features=4096, bias=False)
                    )
                  )
                )
                (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
              )
              (v_proj): Linear(
                in_features=4096, out_features=4096, bias=False
                (naslora_module): ModuleDict(
                  (default): ModuleList(
                    (0): ModuleList(
                      (0): Linear(in_features=4096, out_features=2, bias=False)
                      (1): Linear(in_features=2, out_features=4096, bias=False)
                    )
                  )
                )
                (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
              )
              (o_proj): Linear(
                in_features=4096, out_features=4096, bias=False
                (naslora_module): ModuleDict(
                  (default): ModuleList(
                    (0): ModuleList(
                      (0): Linear(in_features=4096, out_features=2, bias=False)
                      (1): Linear(in_features=2, out_features=4096, bias=False)
                    )
                  )
                )
                (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
              )
              (rotary_emb): LlamaRotaryEmbedding()
            )
            (mlp): LlamaMLP(
              (gate_proj): Linear(
                in_features=4096, out_features=11008, bias=False
                (naslora_module): ModuleDict(
                  (default): ModuleList(
                    (0): ModuleList(
                      (0): Linear(in_features=4096, out_features=2, bias=False)
                      (1): Linear(in_features=2, out_features=11008, bias=False)
                    )
                  )
                )
                (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
              )
              (up_proj): Linear(
                in_features=4096, out_features=11008, bias=False
                (naslora_module): ModuleDict(
                  (default): ModuleList(
                    (0): ModuleList(
                      (0): Linear(in_features=4096, out_features=2, bias=False)
                      (1): Linear(in_features=2, out_features=11008, bias=False)
                    )
                  )
                )
                (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
              )
              (down_proj): Linear(
                in_features=11008, out_features=4096, bias=False
                (naslora_module): ModuleDict(
                  (default): ModuleList(
                    (0): ModuleList(
                      (0): Linear(in_features=11008, out_features=2, bias=False)
                      (1): Linear(in_features=2, out_features=4096, bias=False)
                    )
                  )
                )
                (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
              )
              (act_fn): SiLUActivation()
            )
            (input_layernorm): LlamaRMSNorm()
            (post_attention_layernorm): LlamaRMSNorm()
          )
        )
        (norm): LlamaRMSNorm()
      )
      (lm_head): Linear(
        in_features=4096, out_features=32001, bias=False
        (naslora_module): ModuleDict(
          (default): ModuleList(
            (0): ModuleList(
              (0): Linear(in_features=4096, out_features=2, bias=False)
              (1): Linear(in_features=2, out_features=32001, bias=False)
            )
          )
        )
        (naslora_weights): ParameterDict(  (default): Parameter containing: [torch.cuda.BFloat16Tensor of size 1 (GPU 0)])
      )
    )
  )
)